vcr_cassettes/payments_list.json

{
    "version": 1, 
    "interactions": [
        {
            "request": {
                "body": null, 
                "headers": {
                    "Connection": [
                        "keep-alive"
                    ], 
                    "Beyonic-Version": [
                        "v2"
                    ], 
                    "Accept-Encoding": [
                        "gzip, deflate"
                    ], 
                    "Accept": [
                        "*/*"
                    ], 
                    "User-Agent": [
                        "python-requests/2.7.0 CPython/2.7.10 Darwin/15.0.0"
                    ]
                }, 
                "method": "GET", 
                "uri": "http://localhost:8000/api/payments"
            }, 
            "response": {
                "status": {
                    "message": "OK", 
                    "code": 200
                }, 
                "headers": {
                    "content-language": [
                        "en"
                    ], 
                    "vary": [
                        "Accept, Accept-Language, Cookie"
                    ], 
                    "server": [
                        "Werkzeug/0.9.4 Python/2.7.10"
                    ], 
                    "connection": [
                        "close"
                    ], 
                    "allow": [
                        "GET, POST, HEAD, OPTIONS"
                    ], 
                    "date": [
                        "Wed, 11 Nov 2015 05:02:34 GMT"
                    ], 
                    "x-frame-options": [
                        "SAMEORIGIN"
                    ], 
                    "content-type": [
                        "application/json"
                    ]
                }, 
                "body": {
                    "string": "{\"count\":154,\"next\":\"http://localhost:8000/api/payments?offset=10\",\"previous\":null,\"results\":[{\"id\":1,\"organization\":1,\"amount\":\"0.0000\",\"currency\":\"UGX\",\"payment_type\":\"money\",\"metadata\":null,\"description\":\"Test\",\"phone_nos\":[],\"state\":\"approved\",\"last_error\":\"\",\"rejected_reason\":null,\"rejected_by\":null,\"rejected_time\":null,\"cancelled_reason\":null,\"cancelled_by\":null,\"cancelled_time\":null,\"created\":\"2013-08-20T17:21:39Z\",\"author\":1,\"modified\":\"2013-08-20T17:21:39Z\",\"updated_by\":null,\"start_date\":\"2013-08-20T00:00:00Z\"},{\"id\":2,\"organization\":1,\"amount\":\"200.0000\",\"currency\":\"UGX\",\"payment_type\":\"money\",\"metadata\":null,\"description\":\"Test2\",\"phone_nos\":[\"+256784522611\"],\"state\":\"scheduled\",\"last_error\":\"\",\"rejected_reason\":null,\"rejected_by\":null,\"rejected_time\":null,\"cancelled_reason\":null,\"cancelled_by\":null,\"cancelled_time\":null,\"created\":\"2013-08-22T01:53:35Z\",\"author\":1,\"modified\":\"2013-08-22T01:53:36Z\",\"updated_by\":1,\"start_date\":\"2013-08-21T00:00:00Z\"},{\"id\":3,\"organization\":1,\"amount\":\"200.0000\",\"currency\":\"UGX\",\"payment_type\":\"money\",\"metadata\":null,\"description\":\"Test3\",\"phone_nos\":[\"+256784522611\"],\"state\":\"processed_with_errors\",\"last_error\":\"Last Error: System error. - Error with payment 1. Error: (1048, \\\"Column 'organization_id' cannot be null\\\") Type: <class 'django.db.utils.IntegrityError'>\",\"rejected_reason\":null,\"rejected_by\":null,\"rejected_time\":null,\"cancelled_reason\":null,\"cancelled_by\":null,\"cancelled_time\":null,\"created\":\"2013-08-22T03:16:41Z\",\"author\":1,\"modified\":\"2013-09-29T23:26:02Z\",\"updated_by\":1,\"start_date\":\"2013-08-21T00:00:00Z\"},{\"id\":4,\"organization\":1,\"amount\":\"100.0000\",\"currency\":\"UGX\",\"payment_type\":\"money\",\"metadata\":null,\"description\":\"Test 4\",\"phone_nos\":[\"+256777777777\"],\"state\":\"processed_with_errors\",\"last_error\":\"Last Error: System error. - Error with payment 2. Error: (1048, \\\"Column 'organization_id' cannot be null\\\") Type: <class 'django.db.utils.IntegrityError'>\",\"rejected_reason\":null,\"rejected_by\":null,\"rejected_time\":null,\"cancelled_reason\":null,\"cancelled_by\":null,\"cancelled_time\":null,\"created\":\"2013-08-24T01:51:33Z\",\"author\":1,\"modified\":\"2013-09-29T23:26:02Z\",\"updated_by\":1,\"start_date\":\"2013-08-23T00:00:00Z\"},{\"id\":5,\"organization\":1,\"amount\":\"300.0000\",\"currency\":\"UGX\",\"payment_type\":\"money\",\"metadata\":null,\"description\":\"Test 5\",\"phone_nos\":[\"+25678888888\"],\"state\":\"scheduled\",\"last_error\":\"\",\"rejected_reason\":null,\"rejected_by\":null,\"rejected_time\":null,\"cancelled_reason\":null,\"cancelled_by\":null,\"cancelled_time\":null,\"created\":\"2013-08-24T02:12:19Z\",\"author\":1,\"modified\":\"2013-08-24T02:12:19Z\",\"updated_by\":1,\"start_date\":\"2013-08-23T00:00:00Z\"},{\"id\":6,\"organization\":1,\"amount\":\"1000.0000\",\"currency\":\"UGX\",\"payment_type\":\"money\",\"metadata\":null,\"description\":\"Test 6\",\"phone_nos\":[\"+256784522611\"],\"state\":\"scheduled\",\"last_error\":\"\",\"rejected_reason\":null,\"rejected_by\":null,\"rejected_time\":null,\"cancelled_reason\":null,\"cancelled_by\":null,\"cancelled_time\":null,\"created\":\"2013-08-25T15:56:08Z\",\"author\":1,\"modified\":\"2013-08-25T15:56:08Z\",\"updated_by\":1,\"start_date\":\"2013-08-25T00:00:00Z\"},{\"id\":7,\"organization\":1,\"amount\":\"200.0000\",\"currency\":\"UGX\",\"payment_type\":\"money\",\"metadata\":null,\"description\":\"Test 7\",\"phone_nos\":[\"+256784522611\"],\"state\":\"processed_with_errors\",\"last_error\":\"Last Error: System error. - Error with payment 5. Error: (1452, 'Cannot add or update a child row: a foreign key constraint fails (`sasula`.`accounts_transaction`, CONSTRAINT `FK_Inventory_Self` FOREIGN KEY (`account_id`, `opening_balance_date`, `opening_balance`) REFERENCES `accoun\",\"rejected_reason\":null,\"rejected_by\":null,\"rejected_time\":null,\"cancelled_reason\":null,\"cancelled_by\":null,\"cancelled_time\":null,\"created\":\"2013-08-25T15:56:37Z\",\"author\":1,\"modified\":\"2013-09-29T23:26:02Z\",\"updated_by\":1,\"start_date\":\"2013-08-25T00:00:00Z\"},{\"id\":8,\"organization\":1,\"amount\":\"100.0000\",\"currency\":\"UGX\",\"payment_type\":\"money\",\"metadata\":null,\"description\":\"Test 7\",\"phone_nos\":[\"+256784522611\"],\"state\":\"processed_with_errors\",\"last_error\":\"Last Error: System error. - Error with payment 6. Error: (1452, 'Cannot add or update a child row: a foreign key constraint fails (`sasula`.`accounts_transaction`, CONSTRAINT `FK_Inventory_Self` FOREIGN KEY (`account_id`, `opening_balance_date`, `opening_balance`) REFERENCES `accoun\",\"rejected_reason\":null,\"rejected_by\":null,\"rejected_time\":null,\"cancelled_reason\":null,\"cancelled_by\":null,\"cancelled_time\":null,\"created\":\"2013-08-25T17:10:10Z\",\"author\":1,\"modified\":\"2013-09-29T23:26:02Z\",\"updated_by\":1,\"start_date\":\"2013-08-25T00:00:00Z\"},{\"id\":9,\"organization\":1,\"amount\":\"100.0000\",\"currency\":\"UGX\",\"payment_type\":\"money\",\"metadata\":null,\"description\":\"Test 8\",\"phone_nos\":[\"+256784522611\"],\"state\":\"processed_with_errors\",\"last_error\":\"Last Error: System error. - Error with payment 7. Error: (1452, 'Cannot add or update a child row: a foreign key constraint fails (`sasula`.`accounts_transaction`, CONSTRAINT `FK_Inventory_Self` FOREIGN KEY (`account_id`, `opening_balance_date`, `opening_balance`) REFERENCES `accounts_transaction` (`account_id`, `created`)') Type: <class 'django.db.utils.IntegrityError'>\",\"rejected_reason\":null,\"rejected_by\":null,\"rejected_time\":null,\"cancelled_reason\":null,\"cancelled_by\":null,\"cancelled_time\":null,\"created\":\"2013-08-25T17:26:51Z\",\"author\":1,\"modified\":\"2013-09-29T23:26:02Z\",\"updated_by\":1,\"start_date\":\"2013-08-25T00:00:00Z\"},{\"id\":10,\"organization\":1,\"amount\":\"300.0000\",\"currency\":\"UGX\",\"payment_type\":\"money\",\"metadata\":null,\"description\":\"Test 9\",\"phone_nos\":[\"+256784522611\"],\"state\":\"processed_with_errors\",\"last_error\":\"Last Error: System error. - Error with payment 8. Error: Unsupported Amount. Amount must be above UGX 1000 Type: <type 'exceptions.Exception'>\",\"rejected_reason\":null,\"rejected_by\":null,\"rejected_time\":null,\"cancelled_reason\":null,\"cancelled_by\":null,\"cancelled_time\":null,\"created\":\"2013-08-26T06:39:17Z\",\"author\":1,\"modified\":\"2013-09-29T23:26:02Z\",\"updated_by\":1,\"start_date\":\"2013-08-26T00:00:00Z\"}]}"
                }
            }
        }
    ]
}