vcr_cassettes/payments_create_get.json

{
    "version": 1, 
    "interactions": [
        {
            "request": {
                "body": "description=Sample+description&currency=UGX&amount=4000&phonenumber=%2B256773712831&payment_type=money&callback_url=https%3A%2F%2Fgoogle.com", 
                "headers": {
                    "Content-Length": [
                        "140"
                    ], 
                    "Accept-Encoding": [
                        "gzip, deflate"
                    ], 
                    "Accept": [
                        "*/*"
                    ], 
                    "User-Agent": [
                        "python-requests/2.7.0 CPython/2.7.10 Darwin/15.0.0"
                    ], 
                    "Connection": [
                        "keep-alive"
                    ], 
                    "Beyonic-Version": [
                        "v2"
                    ], 
                    "Content-Type": [
                        "application/x-www-form-urlencoded"
                    ]
                }, 
                "method": "POST", 
                "uri": "http://localhost:8000/api/payments"
            }, 
            "response": {
                "status": {
                    "message": "CREATED", 
                    "code": 201
                }, 
                "headers": {
                    "content-language": [
                        "en"
                    ], 
                    "vary": [
                        "Accept, Accept-Language, Cookie"
                    ], 
                    "server": [
                        "Werkzeug/0.9.4 Python/2.7.10"
                    ], 
                    "connection": [
                        "close"
                    ], 
                    "allow": [
                        "GET, POST, HEAD, OPTIONS"
                    ], 
                    "date": [
                        "Wed, 11 Nov 2015 05:02:34 GMT"
                    ], 
                    "x-frame-options": [
                        "SAMEORIGIN"
                    ], 
                    "content-type": [
                        "application/json"
                    ]
                }, 
                "body": {
                    "string": "{\"id\":343,\"organization\":1,\"amount\":\"4000.0000\",\"currency\":\"UGX\",\"payment_type\":\"money\",\"metadata\":{},\"description\":\"Sample description\",\"phone_nos\":[\"+256773712831\"],\"state\":\"new\",\"last_error\":\"\",\"rejected_reason\":null,\"rejected_by\":null,\"rejected_time\":null,\"cancelled_reason\":null,\"cancelled_by\":null,\"cancelled_time\":null,\"created\":\"2015-11-11T05:02:34.907095Z\",\"author\":42,\"modified\":\"2015-11-11T05:02:34.910623Z\",\"updated_by\":42,\"start_date\":\"2015-11-11T05:02:34.907127Z\"}"
                }
            }
        }, 
        {
            "request": {
                "body": null, 
                "headers": {
                    "Connection": [
                        "keep-alive"
                    ], 
                    "Beyonic-Version": [
                        "v2"
                    ], 
                    "Accept-Encoding": [
                        "gzip, deflate"
                    ], 
                    "Accept": [
                        "*/*"
                    ], 
                    "User-Agent": [
                        "python-requests/2.7.0 CPython/2.7.10 Darwin/15.0.0"
                    ]
                }, 
                "method": "GET", 
                "uri": "http://localhost:8000/api/payments/343"
            }, 
            "response": {
                "status": {
                    "message": "OK", 
                    "code": 200
                }, 
                "headers": {
                    "content-language": [
                        "en"
                    ], 
                    "vary": [
                        "Accept, Accept-Language, Cookie"
                    ], 
                    "server": [
                        "Werkzeug/0.9.4 Python/2.7.10"
                    ], 
                    "connection": [
                        "close"
                    ], 
                    "allow": [
                        "GET, HEAD, OPTIONS"
                    ], 
                    "date": [
                        "Wed, 11 Nov 2015 05:02:34 GMT"
                    ], 
                    "x-frame-options": [
                        "SAMEORIGIN"
                    ], 
                    "content-type": [
                        "application/json"
                    ]
                }, 
                "body": {
                    "string": "{\"id\":343,\"organization\":1,\"amount\":\"4000.0000\",\"currency\":\"UGX\",\"payment_type\":\"money\",\"metadata\":{},\"description\":\"Sample description\",\"phone_nos\":[\"+256773712831\"],\"state\":\"new\",\"last_error\":\"\",\"rejected_reason\":null,\"rejected_by\":null,\"rejected_time\":null,\"cancelled_reason\":null,\"cancelled_by\":null,\"cancelled_time\":null,\"created\":\"2015-11-11T05:02:34Z\",\"author\":42,\"modified\":\"2015-11-11T05:02:34Z\",\"updated_by\":42,\"start_date\":\"2015-11-11T05:02:34Z\"}"
                }
            }
        }
    ]
}